In [16]:
import matplotlib.pyplot as plt
import pandas as pd

 
FILENAME = "5A10FF1E-1429-3EA9-A727-26B11DAFD2FC.csv"
df = pandas.read_csv(FILENAME)
#print(tempData)

#df['Value'] = df['Value'].replace("(D)",math.nan)

#replace the "," with ""
df['Value'] = df['Value'].str.replace(",","")

df['Value'] = pd.to_numeric(df['Value'],errors='coerce')

df.dropna(subset=['Value'], inplace=True)
#print(df)

In [20]:
#Show honey production levels over the years, state by state
#columns we need are year, state, and the value of honey

#before we grabbed all of the unique countries then we itterate over the data
#pandas has all cool trick called groupby

allHoney=[]
allStates=[]
uniqueStates = df['State'].unique()
#without grouping
for state in uniqueStates:
    honey = df[df['State'] == state].groupby('Year')['Value']   #creates a new data set
    print(state,honey.sum())
    allHoney.append(honey.sum())
    allStates.append(state)

ALABAMA Year
2002    1095643.0
2007     348244.0
2012     254742.0
2017     300575.0
Name: Value, dtype: float64
ALASKA Year
2007    12968.0
2012    32623.0
2017    31070.0
Name: Value, dtype: float64
ARIZONA Year
2002    1225457.0
2007    1082717.0
2012    1307878.0
2017     906767.0
Name: Value, dtype: float64
ARKANSAS Year
2002    1733920.0
2007    1571134.0
2012      41991.0
2017     163113.0
Name: Value, dtype: float64
CALIFORNIA Year
2002    15585925.0
2007    14830079.0
2012    11667682.0
2017    13888886.0
Name: Value, dtype: float64
COLORADO Year
2002    550941.0
2007    631689.0
2012    657949.0
2017    356140.0
Name: Value, dtype: float64
CONNECTICUT Year
2002    131982.0
2007    143092.0
2012    155991.0
2017    199631.0
Name: Value, dtype: float64
DELAWARE Year
2002    2400.0
2007    5414.0
2012    7060.0
2017    4359.0
Name: Value, dtype: float64
FLORIDA Year
2002    15549919.0
2007     9939822.0
2012     9224992.0
2017     8104890.0
Name: Value, dtype: float64
GEORGIA Year
2002    1446354.0
2007    2730197.0
2012    2075832.0
2017    1650949.0
Name: Value, dtype: float64
HAWAII Year
2002     966138.0
2007     919104.0
2012     591628.0
2017    2668107.0
Name: Value, dtype: float64
IDAHO Year
2002    2638983.0
2007    1495388.0
2012    1581386.0
2017    1716282.0
Name: Value, dtype: float64
ILLINOIS Year
2002    170527.0
2007    253873.0
2012    390829.0
2017    465497.0
Name: Value, dtype: float64
INDIANA Year
2002    214009.0
2007    216225.0
2012    246218.0
2017    284379.0
Name: Value, dtype: float64
IOWA Year
2002    476139.0
2007    348885.0
2012    209092.0
2017    406417.0
Name: Value, dtype: float64
KANSAS Year
2002    240353.0
2007    214118.0
2012    233194.0
2017    173338.0
Name: Value, dtype: float64
KENTUCKY Year
2002    154567.0
2007    184037.0
2012    335964.0
2017    287363.0
Name: Value, dtype: float64
LOUISIANA Year
2002     834054.0
2007    1691558.0
2012     397905.0
2017     483124.0
Name: Value, dtype: float64
MAINE Year
2002    172373.0
2007     94703.0
2012    383687.0
2017    170083.0
Name: Value, dtype: float64
MARYLAND Year
2002    127778.0
2007    107112.0
2012    104925.0
2017    156762.0
Name: Value, dtype: float64
MASSACHUSETTS Year
2002    164835.0
2007    203850.0
2012     98095.0
2017    231738.0
Name: Value, dtype: float64
MICHIGAN Year
2002    3547944.0
2007    3355150.0
2012    1963716.0
2017    2844559.0
Name: Value, dtype: float64
MINNESOTA Year
2002    4283781.0
2007    6141896.0
2012    3846105.0
2017    4217347.0
Name: Value, dtype: float64
MISSISSIPPI Year
2002     141798.0
2007     555942.0
2012    1624036.0
2017     235019.0
Name: Value, dtype: float64
MISSOURI Year
2002    529411.0
2007    304243.0
2012    172671.0
2017    331922.0
Name: Value, dtype: float64
MONTANA Year
2002    2639697.0
2007    2152498.0
2012    2703942.0
2017    5896788.0
Name: Value, dtype: float64
NEBRASKA Year
2002    1145598.0
2007     843562.0
2012    1764577.0
2017     747971.0
Name: Value, dtype: float64
NEVADA Year
2002     12094.0
2007       900.0
2012    358750.0
2017     14288.0
Name: Value, dtype: float64
NEW HAMPSHIRE Year
2002    58901.0
2007    39129.0
2012    85243.0
2017    59220.0
Name: Value, dtype: float64
NEW JERSEY Year
2002    148257.0
2007    103145.0
2012    106895.0
2017    186993.0
Name: Value, dtype: float64
NEW MEXICO Year
2002      8381.0
2007    508873.0
2012    442006.0
2017    304846.0
Name: Value, dtype: float64
NEW YORK Year
2002    3261870.0
2007    2022971.0
2012    2783991.0
2017    2275703.0
Name: Value, dtype: float64
NORTH CAROLINA Year
2002    411346.0
2007    538891.0
2012    410565.0
2017    517062.0
Name: Value, dtype: float64
NORTH DAKOTA Year
2002     8401937.0
2007    15171406.0
2012    19224985.0
2017    24296437.0
Name: Value, dtype: float64
OHIO Year
2002    1234738.0
2007     968630.0
2012     618584.0
2017     681441.0
Name: Value, dtype: float64
OKLAHOMA Year
2002    284736.0
2007     91175.0
2012     42194.0
2017    146940.0
Name: Value, dtype: float64
OREGON Year
2002    1487883.0
2007    1564766.0
2012    1374914.0
2017    2319544.0
Name: Value, dtype: float64
PENNSYLVANIA Year
2002    1071445.0
2007     887677.0
2012     490154.0
2017     712238.0
Name: Value, dtype: float64
RHODE ISLAND Year
2002    18017.0
2007    15130.0
2012    21379.0
2017    16961.0
Name: Value, dtype: float64
SOUTH CAROLINA Year
2002     33655.0
2007    149992.0
2012    123402.0
2017    221270.0
Name: Value, dtype: float64
SOUTH DAKOTA Year
2002    2675792.0
2007    6159291.0
2012    6746981.0
2017    4503118.0
Name: Value, dtype: float64
TENNESSEE Year
2002    547650.0
2007    363613.0
2012    334556.0
2017    375669.0
Name: Value, dtype: float64
TEXAS Year
2002    1934920.0
2007    5015781.0
2012    5082886.0
2017    2755558.0
Name: Value, dtype: float64
UTAH Year
2002     956825.0
2007    1254000.0
2012     650411.0
2017     887414.0
Name: Value, dtype: float64
VERMONT Year
2002    167030.0
2007    131569.0
2012    388187.0
2017    319678.0
Name: Value, dtype: float64
VIRGINIA Year
2002    366342.0
2007    286039.0
2012    306381.0
2017    267028.0
Name: Value, dtype: float64
WASHINGTON Year
2002    2144212.0
2007    1802825.0
2012    1396424.0
2017    2182806.0
Name: Value, dtype: float64
WEST VIRGINIA Year
2002     62655.0
2007    200148.0
2012    169800.0
2017    225940.0
Name: Value, dtype: float64
WISCONSIN Year
2002    3035632.0
2007    2009058.0
2012    1751329.0
2017    1101397.0
Name: Value, dtype: float64
WYOMING Year
2002    1069386.0
2007    2656119.0
2012    2092818.0
2017    1065682.0
Name: Value, dtype: float64